{
  "architectures": ["PhiForCausalLM"],
  "attention_dropout": 0.0,
  "bos_token_id": 100257,
  "eos_token_id": 100265,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "intermediate_size": 17920,
  "max_position_embeddings": 16384,
  "model_type": "phi3",
  "num_attention_heads": 40,
  "num_hidden_layers": 40,
  "num_key_value_heads": 10,
  "original_max_position_embeddings": 4096,
  "partial_rotary_factor": 0.5,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "sliding_window": 2048,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.0",
  "use_cache": true,
  "vocab_size": 100352
}
